In [45]:
import pandas as pd

csv_path = 'pokemon.csv'

In [46]:
# 1)
store_inventory =  {'Jabón': [10,15], 'Papel': [12,25], 'Guantes': [30,50], 'Medicina' : [40,350]}
pd.Series(store_inventory)

Jabón        [10, 15]
Papel        [12, 25]
Guantes      [30, 50]
Medicina    [40, 350]
dtype: object

In [47]:
# 2)
game_reviews = [['Zelda','MHGU','Smash','The last of us 2'],['8.6','8.5','8.7','3.4']]
pd.DataFrame(game_reviews)

       0     1      2                 3
0  Zelda  MHGU  Smash  The last of us 2
1    8.6   8.5    8.7               3.4

In [48]:
# 3)
pokemon_df = pd.read_csv(csv_path)
pokemon_df[:9]

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,318,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,405,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,525,80,82,83,100,100,80,1,False
3,4,Charmander,Fire,NaN,309,39,52,43,60,50,65,1,False
4,5,Charmeleon,Fire,NaN,405,58,64,58,80,65,80,1,False
5,6,Charizard,Fire,Flying,534,78,84,78,109,85,100,1,False
6,7,Squirtle,Water,NaN,314,44,48,65,50,64,43,1,False
7,8,Wartortle,Water,NaN,405,59,63,80,65,80,58,1,False
8,9,Blastoise,Water,NaN,530,79,83,100,85,105,78,1,False

In [49]:
# 4)
pokemon_df[-4:]

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
147,148,Dragonair,Dragon,NaN,420,61,84,65,70,70,70,1,False
148,149,Dragonite,Dragon,Flying,600,91,134,95,100,100,80,1,False
149,150,Mewtwo,Psychic,NaN,680,106,110,90,154,90,130,1,True
150,151,Mew,Psychic,NaN,600,100,100,100,100,100,100,1,True

In [50]:
# 5)
pokemon_df = pokemon_df.set_index('#')
pokemon_df

,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
#,,,,,,,,,,,,
1,Bulbasaur,Grass,Poison,318,45,49,49,65,65,45,1,False
2,Ivysaur,Grass,Poison,405,60,62,63,80,80,60,1,False
3,Venusaur,Grass,Poison,525,80,82,83,100,100,80,1,False
4,Charmander,Fire,NaN,309,39,52,43,60,50,65,1,False
5,Charmeleon,Fire,NaN,405,58,64,58,80,65,80,1,False
...,...,...,...,...,...,...,...,...,...,...,...,...
147,Dratini,Dragon,NaN,300,41,64,45,50,50,50,1,False
148,Dragonair,Dragon,NaN,420,61,84,65,70,70,70,1,False
149,Dragonite,Dragon,Flying,600,91,134,95,100,100,80,1,False
150,Mewtwo,Psychic,NaN,680,106,110,90,154,90,130,1,True
151,Mew,Psychic,NaN,600,100,100,100,100,100,100,1,True

In [51]:
# 6)
pokemon_df.iloc[24]

Name           Pikachu
Type 1        Electric
Type 2             NaN
Total              320
HP                  35
Attack              55
Defense             40
Sp. Atk             50
Sp. Def             50
Speed               90
Generation           1
Legendary        False
Name: 25, dtype: object

In [52]:
# 7)
pokemon_df[pokemon_df['Name'] == 'Jolteon']

,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
#,,,,,,,,,,,,
135,Jolteon,Electric,NaN,525,65,65,60,110,95,130,1,False

In [53]:
# 8)
pokemon_df[(pokemon_df['Type 1'] == 'Dragon') | (pokemon_df['Type 2'] == 'Dragon')]

,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
#,,,,,,,,,,,,
147,Dratini,Dragon,NaN,300,41,64,45,50,50,50,1,False
148,Dragonair,Dragon,NaN,420,61,84,65,70,70,70,1,False
149,Dragonite,Dragon,Flying,600,91,134,95,100,100,80,1,False

In [54]:
# 9)
pokemon_df[pokemon_df['HP'] > 120]

,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
#,,,,,,,,,,,,
40,Wigglytuff,Normal,Fairy,435,140,70,45,85,50,45,1,False
113,Chansey,Normal,NaN,450,250,5,5,35,105,50,1,False
131,Lapras,Water,Ice,535,130,85,80,85,95,60,1,False
134,Vaporeon,Water,NaN,525,130,65,60,110,95,65,1,False
143,Snorlax,Normal,NaN,540,160,110,65,65,110,30,1,False

In [55]:
# 10)
columns = ['Name' ,'Attack', 'Defense']
pokemon_df[pokemon_df['Legendary']][columns]

         Name  Attack  Defense
#
144  Articuno      85      100
145    Zapdos      90       85
146   Moltres     100       90
150    Mewtwo     110       90
151       Mew     100      100